DataProcessors/гф_ПубликацияВНК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ПубликацияВНК</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/гф_СтатусыGTIN.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_СтатусыGTIN</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>GTIN</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/гф_ПубликацияВНК/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// #wortmann { 
	// Добавление новой команды на форму
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eeb9026f5d81aa
	// Галфинд_Домнышева 2024/01/23
	Команда = Команды.Добавить("гф_ЗаполнитьПустыеСтатусыПоШК");
	Команда.Заголовок = "Заполнить пустые статусы по ШК";
	Команда.Действие = "гф_ЗаполнитьПустыеСтатусыПоШК";
	Команда.Отображение = ОтображениеКнопки.Текст;

	ТипКнопкаФормы = Тип("КнопкаФормы");
	НоваяКнопка = Элементы.Вставить("гф_КнопкаЗаполнитьПустыеСтатусыПоШК", ТипКнопкаФормы, 
	Элементы.ПубликуемыеТовары.КоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "гф_ЗаполнитьПустыеСтатусыПоШК";
	// } #wortmann
КонецПроцедуры

// #wortmann { 
// Действие команды гф_ЗаполнитьПустыеСтатусыПоШК
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eeb9026f5d81aa
// Галфинд_Домнышева 2024/01/23
&НаКлиенте
Процедура гф_ЗаполнитьПустыеСтатусыПоШК(Команда)
	
	гф_ЗаполнитьПустыеСтатусыПоШКНаСервере();
	
КонецПроцедуры// } #wortmann

// #wortmann { 
// Действие команды гф_ЗаполнитьПустыеСтатусыПоШК
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eeb9026f5d81aa
// Галфинд_Домнышева 2024/01/23
&НаСервере
Процедура гф_ЗаполнитьПустыеСтатусыПоШКНаСервере()

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СтатусВКИС", Перечисления.гф_СтатусыGTIN_В_НК.ПустаяСсылка());
	
	ТоварыКОтбору = Объект.ПубликуемыеТовары.Выгрузить(, "Номенклатура, Характеристика, СтатусВКИС"); 
	ДляРедактирования = ТоварыКОтбору.Скопировать(СтруктураПоиска, "Номенклатура, Характеристика"); 
	
	Если ДляРедактирования.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для поиска в РС ""Штрихкоды Номенклатуры""");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.Номенклатура КАК Номенклатура,
		|	Данные.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&ДляРедактирования КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.гф_СостояниеВыгрузкиНоменклатуры КАК Статус
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
		|			(ВЫБРАТЬ
		|				ВТ_Данные.Номенклатура,
		|				ВТ_Данные.Характеристика
		|			ИЗ
		|				ВТ_Данные КАК ВТ_Данные)
		|	И НЕ ШтрихкодыНоменклатуры.гф_СостояниеВыгрузкиНоменклатуры = Значение(Перечисление.гф_СтатусыGTIN_В_НК.Пустаяссылка)
		|	И НЕ ШтрихкодыНоменклатуры.гф_СостояниеВыгрузкиНоменклатуры = """" ";
	
	Запрос.УстановитьПараметр("ДляРедактирования", ДляРедактирования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		запись = РегистрыСведений.гф_СтатусыGTIN.СоздатьМенеджерЗаписи();
		запись.Период = ТекущаяДатаСеанса();
		запись.Номенклатура = Выборка.Номенклатура;
		запись.Характеристика = Выборка.Характеристика;
		
		запись.Статус = Выборка.Статус;
		запись.GTIN = Выборка.Штрихкод;
		Запись.Организация = Объект.Организация;
		запись.Записать();
	КонецЦикла;

	ПерезаполнитьТЧ();
	
	
КонецПроцедуры// } #wortmann 

// #wortmann { 
// Перезаполнение ТЧ ПубликуемыеТовары
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eeb9026f5d81aa
// Галфинд_Домнышева 2024/01/23
Процедура ПерезаполнитьТЧ()     
	
	Для Каждого Строка Из Объект.ПубликуемыеТовары Цикл
		
		ПолучитьДанныеРегистраСтатусыGTIN(Строка);
		
	КонецЦикла;
	
	ЗаполнениеИнформационныхПолей();
	
КонецПроцедуры// } #wortmann
